org/computer_organization.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: Computer Organization

- tags :: [[file:operating_systems.org][Operating Systems]]

* Pipelining
- Increases throughput, but not latency
** Structural Hazard
** Data Hazard
- Resolved with extra hardware
** Control Hazard
- Branch instructions need to tell which branch, but have only just
  read from memory
- Branch prediction (static/dynamic)
* Pipelined Datapath and Control
1. IF: Instruction Fetch
2. ID: Instruction Decode and register file read
3. EX: Execution or address calculation
4. MEM: Data memory access
5. WB: Write Back
** Issues
 1. Write-back stage places the result back into the register file in
    the middle of the data path (Data Hazard)
 2. Selection of the next value of the PC, between incremented PC and
    branch address from the MEM stage (Control Hazard)

Data flow does not affect current instruction, but only influence
later instructions. 

