docs/computer_organization.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-01-02 Tue 14:29 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Computer Organization</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jethro Kuan">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/normalize/7.0.0/normalize.css" />
<link rel="stylesheet" href="./css/orgmin.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">Computer Organization</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org40b3dec">1. Pipelining</a>
<ul>
<li><a href="#org3c78ed2">1.1. Structural Hazard</a></li>
<li><a href="#org56894a2">1.2. Data Hazard</a></li>
<li><a href="#org00f52c3">1.3. Control Hazard</a></li>
</ul>
</li>
<li><a href="#org31a31e1">2. Pipelined Datapath and Control</a>
<ul>
<li><a href="#org8003d8f">2.1. Issues</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org40b3dec" class="outline-2">
<h2 id="org40b3dec"><span class="section-number-2">1</span> Pipelining</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Increases throughput, but not latency</li>
</ul>
</div>
<div id="outline-container-org3c78ed2" class="outline-3">
<h3 id="org3c78ed2"><span class="section-number-3">1.1</span> Structural Hazard</h3>
</div>
<div id="outline-container-org56894a2" class="outline-3">
<h3 id="org56894a2"><span class="section-number-3">1.2</span> Data Hazard</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Resolved with extra hardware</li>
</ul>
</div>
</div>
<div id="outline-container-org00f52c3" class="outline-3">
<h3 id="org00f52c3"><span class="section-number-3">1.3</span> Control Hazard</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Branch instructions need to tell which branch, but have only just
read from memory</li>
<li>Branch prediction (static/dynamic)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org31a31e1" class="outline-2">
<h2 id="org31a31e1"><span class="section-number-2">2</span> Pipelined Datapath and Control</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>IF: Instruction Fetch</li>
<li>ID: Instruction Decode and register file read</li>
<li>EX: Execution or address calculation</li>
<li>MEM: Data memory access</li>
<li>WB: Write Back</li>
</ol>
</div>
<div id="outline-container-org8003d8f" class="outline-3">
<h3 id="org8003d8f"><span class="section-number-3">2.1</span> Issues</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Write-back stage places the result back into the register file in
the middle of the data path (Data Hazard)</li>
<li>Selection of the next value of the PC, between incremented PC and
branch address from the MEM stage (Control Hazard)</li>
</ol>

<p>
Data flow does not affect current instruction, but only influence
later instructions. 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-01-02 Tue 14:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
